# Работа с цифрами числа

### Описание
Часто при работе с числами нам требуется получить информацию о его цифрах.  
Например, найти сумму цифр, количество цифр, минимальную цифру и т.д.  

Вот алгоритм, как с помощью list comprehension получить список цифр числа.
```python
num = 123456

# Конструкция для разбития числа на цифры
digits_list = [int(d) for d in str(num)]  # приводим каждый символ к числу
print(digits_list)
```


### Задачи
1. Получите список цифр числа N с помощью list comprehension
1. Найдите сумму всех цифр
1. Найдите сумму всех четных цифр
1. Найдите количество цифр
1. Найдите минимальную цифру числа
1. Найдите разность первой и последней цифры
